package s2021_07_13;

public class HiJava {

	public static void main(String[] args) {
		System.out.println("안녕 깃허브");
		
		System.out.println("또 만나네 깃허브");
		
		추상 메소드
		여러 객체에 공통되는 사항을 추출하여 부모 클래스에 선언 및 구현을 하고 자식 클래스에는 특징을 구현하여 기능을 확장한다.

		추상 클래스
		추상 클래스(abstract class)란 하나 이상의 추상 메소드(abstract method)를 포함하는 클래스이다.

		인터페이스
		인터페이스(interface)는 자바 프로그래밍 언어에서 클래스들이 구현해야 하는 동작을 지정하는데 사용되는 추상 자료형이다. 
		이들은 프로토콜과 비슷하다. 인터페이스는 interface라는 키워드를 사용하여 선언하며, 메소드 시그너처와 상수 선언(static과 final이 둘 다 선언되는 변수 선언)만을 포함할 수 있다. 
		자바 8 미만의 모든 버전을 기준으로 인터페이스의 모든 메소드는 구현체(메소드 바디)를 포함하고 있지 않다.
		자바 8부터, default와 static 메소드는 interface 정의에 구현체를 가지고 있을 수 있다.

		GUI
		그래픽 사용자 인터페이스(graphical user interface, GUI)는 사용자가 편리하게 사용할 수 있도록 입출력 등의 기능을 알기 쉬운 아이콘 따위의 그래픽으로 나타낸 것이다.
		컴퓨터를 사용하면서, 화면 위의 물체나 틀, 색상과 같은 그래픽 요소들을 어떠한 기능과 용도를 나타내기 위해 고안된 사용자를 위한 컴퓨터 인터페이스이다.
		그래픽 사용자 인터페이스에서 어떤 요소를 제어하려면 그 요소에 해당하는 그래픽을 직접 조작하여야 한다. 일반적으로 2차원의 공간에서 그 기능을 은유적 혹은 대표적으로 나타내는 그래픽으로 요소를 꾸미고 이를 선택, 이동, 복사하여 작동한다.
		이를테면, X자와 같은 형태의 그래픽 요소는 이를 선택하면 삭제하거나 취소하는 기능을 수행하게 되며 어떤 파일을 나타내는 아이콘을 어느 위치에서 다른 하드 디스크의 장소를 나타내는 공간으로 이동하면 복사가 된다.
		컴퓨터 자판의 명령어 입력이 요구되는 명령 줄 인터페이스(CLI)의 가파른 학습 곡선에 대응하여 GUI가 도입되었다.

	}

}
